AnthonyPeleMicrochip/dspic33c-power-board-visualizer-v3-demo-fork/dspic33ak512mps-PBV-v3-dmo.X/mcc_generated_files/adc/adc4.h
/**
 * ADC4 Generated Driver Header File
 * 
 * @file      adc4.h
 *            
 * @ingroup   adcdriver
 *            
 * @brief     This is the generated driver header file for the ADC4 driver          
 *
 * @skipline @version   PLIB Version 1.1.0
 *            
 * @skipline  Device : dsPIC33AK512MPS506
*/

/*disclaimer*/

#ifndef ADC4_H
#define ADC4_H

// Section: Included Files

#include <xc.h>
#include <stdbool.h>
#include <stdint.h>
#include "adc_types.h"
#include "adc_interface.h"

// Section: Data Types

/** 
  @ingroup  adcdriver
  @brief    Defines the ADC Resolution
*/
#define ADC4_RESOLUTION 12

/**
 @ingroup  adcdriver
 @enum     ADC4_CHANNEL
 @brief    Defines the ADC channles that are selected from the MCC Melody 
           User Interface for the ADC conversions.
 @note     The enum list in the Help document might be just a reference to show 
           the analog channel list. Generated enum list is based on the configuration 
           done by user in the MCC Melody user interface.
*/
enum ADC4_CHANNEL
{
    ADC4_Channel2,    /**<Channel Name:Channel_2 connected to ADC4_AN2 */
    ADC4_MAX_CHANNELS = 1    /**< Maximum number of channels configured by user for ADC4 */
};

/**
 @ingroup  adcdriver
 @enum     ADC_CMP
 @brief    Defines the ADC4 comparators that are 
           available for the module to use.
*/
enum ADC4_CMP
{
    ADC4_MAX_CMPS = 0    /**< Maximum Comparators configured by user for ADC4 */
};

// Section: Data Type Definitions

/**
 * @ingroup  adcdriver
 * @brief    Structure object of type ADC_INTERFACE with the custom name
 *           given by the user in the Melody Driver User interface. The default name 
 *           e.g. ADC1 can be changed by the user in the ADC user interface. 
 *           This allows defining a structure with application specific name using 
 *           the 'Custom Name' field. Application specific name allows the API Portability.
*/
extern const struct ADC_INTERFACE ADC4;


// Section: Driver Interface Functions

/**
 * @ingroup  adcdriver
 * @brief    Initializes ADC4 module, using the given initialization data
 *           This function must be called before any other ADC4 function is called
 * @param    none
 * @return   none  
 */
void ADC4_Initialize (void);

/**
 * @ingroup  adcdriver
 * @brief    Deinitializes the ADC4 to POR values
 * @param    none
 * @return   none  
 */
void ADC4_Deinitialize(void);

/**
 * @ingroup  adcdriver
 * @brief    This inline function enables the ADC4 module
 * @pre      none
 * @param    none
 * @return   none  
 */
inline static void ADC4_Enable(void)
{
   AD4CONbits.ON = 1U;
}

/**
 * @ingroup  adcdriver
 * @brief    This inline function disables the ADC4 module
 * @pre      none
 * @param    none
 * @return   none  
 */
inline static void ADC4_Disable(void)
{
   AD4CONbits.ON = 0U;
}

/**
 * @ingroup  adcdriver
 * @brief    This inline function sets software common trigger
 * @pre      none
 * @param    none
 * @return   none  
 */
inline static void ADC4_SoftwareTriggerEnable(void)
{
   AD4SWTRG = 0xFFFFFFFFU;
}

/**
 * @ingroup  adcdriver
 * @brief    This inline function resets software common trigger
 * @pre      none
 * @param    none
 * @return   none  
 */
inline static void ADC4_SoftwareTriggerDisable(void)
{
   AD4SWTRG = 0x0U;
}

/**
 * @ingroup     adcdriver
 * @brief       This inline function sets individual software trigger
 * @pre         none
 * @param[in]   channel - Channel for conversion      none
 * @return      none  
 */
inline static void ADC4_ChannelSoftwareTriggerEnable(const enum ADC4_CHANNEL channel)
{
    switch(channel)
    {
        case ADC4_Channel2:
                AD4SWTRGbits.CH2TRG = 0x1U;
                break;
        default:
                break;
    }
}

/**
 * @ingroup     adcdriver
 * @brief       This inline function clears individual software trigger
 * @pre         none
 * @param[in]   channel - Channel for conversion  
 * @return      none  
 */
inline static void ADC4_ChannelSoftwareTriggerDisable(const enum ADC4_CHANNEL channel)
{
    switch(channel)
    {
        case ADC4_Channel2:
                AD4SWTRGbits.CH2TRG = 0x0U;
                break;
        default:
                break;
    }
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function returns the requested conversion count
 * @pre        none
 * @param[in]  channel - Channel for conversion  
 * @return     requested number of conversions  
 * @note       This function is applicable in Window mode and Integration conversion mode only 
 */
inline static uint16_t ADC4_SampleCountGet(const enum ADC4_CHANNEL channel)
{
    uint16_t count = 0x0U;

    switch(channel)
    {
        case ADC4_Channel2:
                count = AD4CH2CNTbits.CNT;
                break;
        default:
                break;
    }
    return count;
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function returns the status of completed conversion count
 * @pre        none
 * @param[in]  channel - Channel for conversion  
 * @return     number of conversions completed  
 * @note       This function is applicable in Window mode and Integration conversion mode only 
 */
inline static uint16_t ADC4_SampleCountStatusGet(const enum ADC4_CHANNEL channel)
{
    uint16_t countStatus = 0x0U;

    switch(channel)
    {
        case ADC4_Channel2:
                countStatus = AD4CH2CNTbits.CNTSTAT;
                break;
        default:
                break;
    }
    return countStatus;
}

/**
 * @ingroup    adcdriver
 * @brief      Returns the conversion value for the channel selected
 * @pre        This inline function returns the conversion value only after the conversion is complete. 
 *             Conversion completion status can be checked using 
 *             \ref ADC4_IsConversionComplete(channel) function.
 * @param[in]  channel - Selected channel  
 * @return     Returns the analog to digital converted value  
 */
inline static uint32_t ADC4_ConversionResultGet(const enum ADC4_CHANNEL channel)
{
    uint32_t result = 0x0U;

    switch(channel)
    {
        case ADC4_Channel2:
                result = AD4CH2DATA;
                break;
        default:
                break;
    }
    return result;
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function returns the status of conversion.This function is used to 
 *             determine if conversion is completed. When conversion is complete 
 *             the function returns true otherwise false.
 * @pre        \ref ADC4_SoftwareTriggerEnable() function should have been 
 *             called before calling this function.
 * @param[in]  channel - Selected channel  
 * @return     true - Conversion is complete.
 * @return     false - Conversion is not complete.  
 */
inline static bool ADC4_IsConversionComplete(const enum ADC4_CHANNEL channel)
{
    bool status = false;

    switch(channel)
    {
        case ADC4_Channel2:
                status = AD4STATbits.CH2RDY;
                break;
        default:
                break;
    }

    return status;
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function enables individual channel interrupt
 * @pre        none
 * @param[in]  channel - Selected channel  
 * @return     none  
 */
inline static void ADC4_IndividualChannelInterruptEnable(const enum ADC4_CHANNEL channel)
{
    switch(channel)
    {
        case ADC4_Channel2:
                IEC7bits.AD4CH2IE = 1U;
                break;
        default:
                break;
    }
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function disables individual channel interrupt
 * @pre        none
 * @param[in]  channel - Selected channel  
 * @return     none  
 */
inline static void ADC4_IndividualChannelInterruptDisable(const enum ADC4_CHANNEL channel)
{
    switch(channel)
    {
        case ADC4_Channel2:
                IEC7bits.AD4CH2IE = 0U;
                break;
        default:
                break;
    }
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function clears individual channel interrupt flag
 * @pre        The flag is not cleared without reading the data from buffer.
 *             Hence call \ref ADC4_ConversionResultGet() function to read data 
 *             before calling this function
 * @param[in]  channel - Selected channel  
 * @return     none  
 */
inline static void ADC4_IndividualChannelInterruptFlagClear(const enum ADC4_CHANNEL channel)
{
    switch(channel)
    {
        case ADC4_Channel2:
                IFS7bits.AD4CH2IF = 0U;
                break;
        default:
                break;
    }
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function allows selection of priority for individual channel interrupt
 * @pre        none
 * @param[in]  channel - Selected channel 
 * @param[in]  priorityValue  -  The numerical value of interrupt priority
 * @return     none  
 */
inline static void ADC4_IndividualChannelInterruptPrioritySet(const enum ADC4_CHANNEL channel, enum INTERRUPT_PRIORITY priorityValue)
{
	switch(channel)
	{
		case ADC4_Channel2:
				IPC28bits.AD4CH2IP = priorityValue;
				break;
		default:
				break;
	}
}

/**
 * @ingroup    adcdriver
 * @brief      This function can be used to override default callback \ref ADC4_ChannelCallback
 *             and to define custom callback for ADC4 Channel event. 
 *             Read the conversion result of the corresponding channel in the custom callback.
 * @pre        none
 * @param[in]  callback - Address of the callback function.  
 * @return     none  
 */
void ADC4_ChannelCallbackRegister(void(*callback)(const enum ADC4_CHANNEL channel, uint16_t adcVal));

/**
 * @ingroup    adcdriver
 * @brief      This is the default callback function for all the analog channels. 
 *             This callback is triggered once the channel conversion is done for a
 *             channel and to read the conversion result of the corresponding channel
 * @pre        none
 * @param[in]  channel - conversion completed channel
 * @param[in]  adcVal - conversion result of channel  
 * @return     none  
 */
void ADC4_ChannelCallback(const enum ADC4_CHANNEL channel, uint16_t adcVal);

/**
 * @ingroup    adcdriver
 * @brief      This function can be used to override default callback \ref ADC4_Result32BitChannelCallback
 *             and to define custom callback for ADC4 Channel event. 
 * @pre        none
 *             Read the conversion result of the corresponding channel in the custom callback.
 * @param[in]  callback - Address of the callback function.  
 * @return     none  
 */
void ADC4_Result32BitChannelCallbackRegister(void(*callback)(const enum ADC4_CHANNEL channel, uint32_t adcVal));

/**
 * @ingroup    adcdriver
 * @brief      This is the default callback function for all the analog channels. 
 *             This callback is triggered once the channel conversion is done for a
 *             channel and to read the conversion result of the corresponding channel
 * @pre        none
 * @param[in]  channel - conversion completed channel
 * @param[in]  adcVal - conversion result of channel  
 * @return     none  
 */
void ADC4_Result32BitChannelCallback(const enum ADC4_CHANNEL channel, uint32_t adcVal);

/**
 * @ingroup    adcdriver
 * @brief      This function can be used to override default callback and to 
 *             define custom callback for ADC4_Comparator event
 * @pre        none
 * @param[in]  callback - Address of the callback function.  
 * @return     none  
 */
void ADC4_ComparatorCallbackRegister(void(*callback)(const enum ADC4_CMP comparator));

/**
 * @ingroup    adcdriver
 * @brief      Comparator callback function
 * @pre        none
 * @param[in]  comparator - comparator in which compare event occurred  
 * @return     none  
 */
void ADC4_ComparatorCallback(const enum ADC4_CMP comparator);

/**
 * @ingroup    adcdriver
 * @brief      This function call used only in polling mode, if channel 
 *             conversion is done for requested channel, the calls the 
 *             respective callback function
 * @pre        \ref ADC4_Initialize() function should have been  
 *             called before calling this function.
 * @param[in]  channel - Selected channel.  
 * @return     none  
 * @note       This function has to be polled to notify channel callbacks and clear 
 *             the channel interrupt flags in non-interrupt mode of ADC
 */
void ADC4_ChannelTasks(const enum ADC4_CHANNEL channel);


/**
 * @ingroup  adcdriver
 * @brief    Enables power for ADC4 Core
 *           This function is used to set the analog and digital power for 
 *           ADC4 shared Core.
 * @pre      none
 * @param    none
 * @return   none  
 */
void ADC4_SharedCorePowerEnable(void);

/**
 * @ingroup  adcdriver
 * @brief    Calibrates the ADC4 Core
 * @pre      none 
 * @param    none
 * @return   none  
 */
void ADC4_SharedCoreCalibration(void);

/**
 * @ingroup  adcdriver
 * @brief    Sets PWM trigger source for corresponding analog input 
 * @param[in]  channel - Selected channel  
 * @param[in]  pwmInstance - PWM instance for the trigger source
 * @param[in]  triggerNumber - 1, for PWMx Trigger 1
 * @param[in]  triggerNumber - 2, for PWMx Trigger 2
 * @return   none  
 * @note     Configure PWM trigger value using \ref PWM_TriggerACompareValueSet, \ref PWM_TriggerBCompareValueSet
 *           or \ref PWM_TriggerCCompareValueSet before calling this funcion and enable corresponding 
 *           PWM trigger using \ref PWM_Trigger1Enable or \ref PWM_Trigger2Enable post calling it.
 */
void ADC4_PWMTriggerSourceSet(const enum ADC4_CHANNEL channel, enum ADC_PWM_INSTANCE pwmInstance, enum ADC_PWM_TRIGGERS triggerNumber);


#endif //_ADC4_H
    
/**
 End of File
*/

